### Pandas (Series) Vs Pandas (Data Frame)

In [1]:
import pandas as pd

In [3]:
#Pandas (Series)
s1=pd.Series([1,2,3,4])
s1

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
#Pandas (DataFrame)
s1=pd.DataFrame([1,2,3,4])
s1

   0
0  1
1  2
2  3
3  4

### Pandas Data Frame can be created using
- List
- Nested List
- Dictionary
- Numpy array
- Series

- List

In [5]:
import pandas as pd

list1= [11,22,33,44,55]
df=pd.DataFrame(list1)
df

    0
0  11
1  22
2  33
3  44
4  55

- Nested List

In [6]:
nest_list=[['AA',88],['BB',99],['CC',77],['DD',66]]
df=pd.DataFrame(nest_list)
df

    0   1
0  AA  88
1  BB  99
2  CC  77
3  DD  66

- Nested List (with Customized index and columns)

In [7]:
nest_list=[['AA',88],['BB',99],['CC',77],['DD',66]]
df = pd.DataFrame(nest_list, columns=['Name','Marks'], index=['R1','R2','R3','R4'])
df

   Name  Marks
R1   AA     88
R2   BB     99
R3   CC     77
R4   DD     66

- Dictionary

In [9]:
dict={'Name':['AA','BB','CC'],'Marks':[90,80,70]}
df=pd.DataFrame(dict)
df

  Name  Marks
0   AA     90
1   BB     80
2   CC     70

- Dictionary (with Customized index)

In [10]:
df=pd.DataFrame(dict,index=['Row1','Row2','Row3'])
df

     Name  Marks
Row1   AA     90
Row2   BB     80
Row3   CC     70

- Series

In [21]:
dict_series={'Name':pd.Series(['AA','BB','CC','DD']), 'Mark':pd.Series([99,88,77,66])}
df=pd.DataFrame(dict_series)
df

  Name  Mark
0   AA    99
1   BB    88
2   CC    77
3   DD    66

- Columns,index and dtype (change)

In [32]:
nest_list2=[['GG',90],['QQ',80],['TT',70]]
nest_list2

[['GG', 90], ['QQ', 80], ['TT', 70]]

In [34]:
df=pd.DataFrame(nest_list2,columns=['Name','Marks'],index=['R1','R2','R3'],dtype='float')
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_4808\583758025.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(nest_list2,columns=['Name','Marks'],index=['R1','R2','R3'],dtype='float')

   Name  Marks
R1   GG   90.0
R2   QQ   80.0
R3   TT   70.0

### Exercise 
- Create data frame using Nested python list

     City       Temp
1    Ahemdabad   40.1
2    Anand       35.2
3    Baroda      38.5

In [35]:
import pandas as pd

In [37]:
nest_list3=[['Ahmedabad',40],['Anand',35],['Baroda',38]]
nest_list3

[['Ahmedabad', 40], ['Anand', 35], ['Baroda', 38]]

In [38]:
df=pd.DataFrame(nest_list3,columns=['City','Temp'],index=[1,2,3],dtype='float')
df

C:\Users\Dell\AppData\Local\Temp\ipykernel_4808\4260771277.py:1: FutureWarning: Could not cast to float64, falling back to object. This behavior is deprecated. In a future version, when a dtype is passed to 'DataFrame', either all columns will be cast to that dtype, or a TypeError will be raised.
  df=pd.DataFrame(nest_list3,columns=['City','Temp'],index=[1,2,3],dtype='float')

        City  Temp
1  Ahmedabad  40.0
2      Anand  35.0
3     Baroda  38.0